app/Models/Car.php

    static function getCarWithOwner ($number_page)
    {
        return DB::table('car')
            ->join('client', 'client_id', 'client.id')
            ->select('car.id', 'brand','rf_license_number','model', 'client.name as owner_name')
            ->skip(($number_page-1) * 10)
            ->take(10)->get();
---
select `car`.`id`, `brand`, `rf_license_number`, `model`, `client`.`name` as `owner_name` from `car` left join `client` on `client_id` = `client`.`id` order by `model` asc limit 10 offset 10

    static function pageCount($row_on_page)
    {
        $count_page = DB::table('car')->count('id');
---
select count(`id`) as aggregate from `car`

    static function pageCountCarOnParking($row_on_page)
    {
        $count_page = DB::table('car')->where('status', 1)->count('id');
---
select count(`id`) as aggregate from `car` where `status` = 1

    static function getPaginatedCarOnParking($number_page)
    {
        return DB::table('car')
        ->join('client', 'client_id', 'client.id')
        ->select('car.id', 'brand','rf_license_number','model', 'client.name as owner_name')
        ->where('status', 1)
        ->skip(($number_page-1) * 10)
        ->take(10)->get();
---
select `car`.`id`, `brand`, `rf_license_number`, `model`, `client`.`name` as `owner_name` from `car` left join `client` on `client_id` = `client`.`id` where `status` = '1' limit 10 offset 0

    static function getByIdClientNotParking($id)
    {
        return DB::table('car')
            ->where('client_id', $id)
            ->where('status', 0)
            ->get();
---
select * from `car` where `client_id` = '4' and `status` = '0'

    static function updateStatusByCarId($id, $action)
    {
        if($action == 'add') {

            DB::table('car')
            ->where('id', $id)
            ->update(['status' => 1]);

        } else {
            DB::table('car')
            ->where('id', $id)
            ->update(['status' => 0]);
---
update `car` set `status` = '1' where `id` = '11'

    static function getByIdClient($id)
    {
        return DB::table('car')->where('client_id', $id)->get();
---
select * from `car` where `client_id` = '5'