app/Models/Client.php

select * from `client`
---
    static function getAll()
    {
        $clients = DB::table('client')->get();

select * from `client` limit 10 offset 0
---
    static function getPaginated($number_page)
    {
        return DB::table('client')->skip(($number_page - 1) * 10)->take(10)->get();

select count(`phone_number`) as aggregate from `client`
---
    static function pageCount($row_on_page)
    {
        $count_page = DB::table('client')->count('phone_number');

select * from `client` where `id` = '5' limit 1
---
    static function getClientById($id)
    {
        return DB::table('client')->where('id', $id)->first();